BOT_TOKEN = "7588644534:AAHLlv677blhTwvn_owqJMgzCtOf8jZE2PY"  # Замените на реальный токен бота
ADMIN_IDS = [770395684, 7916096765]  # Замените на реальные ID администраторов

ADMIN_USERNAMES = {
    '8087880679': 'dev_sv4',
    '770395684': 'godkivalovskiy'
}
DATABASE_FILE = 'users.db'

SUGGESTION_CHANNEL_ID = -1002288664747  # Замените на реальный ID канала для предложек
LOG_CHANNEL_ID = -1002416925696         # Замените на реальный ID канала для логов

CHANNEL_IDS = {
    "hatakibalova": -1002528108618  # Оставлен только один канал
}

STATUS_EMOJIS = {
    'admin': '👑',
    'verify': '✅',
    'garant': '🛡️',
    'scam': '⚠️',
    'media': '🏆',
    'fame': '⚡',
    'beach': '⛔️',
    'new': '📛',
    'pdf': '🔞'
}

STATUS_NAMES = {
    'admin': 'Администратор',
    'verify': 'Проверенный',
    'garant': 'Гарант',
    'media': 'Медийка',
    'fame': 'Фейм',
    'scam': 'Скам',
    'beach': 'Бомж',
    'new': 'Нью/фаг/ген/кек',
    'pdf': 'Педофил'
}

STATUS_DESCRIPTIONS = {
    'admin': 'Официальный представитель проекта',
    'verify': 'Пользователь подтвердил свою надежность, можете спокойно доверять ему',
    'garant': 'Может выступать посредником в сделках, проверенное лицо',
    'media': 'Известная личность, имеет власть в комьюнити',
    'fame': 'Популярная личность, часто узнается в комьюнити',
    'scam': 'Осторожно, это мошенник!, воздержитесь в сделках с ним',
    'beach': 'Не имеет фейма и репутации в комьюнити',
    'new': 'Нет места нигде, всеобщий позор',
    'pdf': 'Просто лютейший позор, пинать ногами'
}